_org/lzma压缩算法.org
#+STARTUP: showall
#+STARTUP: hidestars
#+OPTIONS: H:2 num:nil tags:nil toc:nil timestamps:t
#+LAYOUT: post
#+AUTHOR: tiankai
#+DATE: 2015-12-19 Sat 22:34
#+TITLE: LZMA压缩算法
#+DESCRIPTION: LZMA Android 
#+TAGS: 压缩算法
#+CATEGORIES: 压缩算法

* LZMA压缩算法的介绍
lzma压缩算法是使用非常广泛的开源的压缩算法,具体的介绍看以查看wiki:[[https://zh.wikipedia.org/wiki/LZMA][lzma维基百科]]
lzma压缩算法的特点:
1. 高压缩比.
   经过测试,压缩率确实很高.
2. 解压缩代码较小.
3. 开源跨平台.
4. 支持在多核心系统上多线程运行. 所以适合嵌入式系统的设计. 

lzma算法的缺点
1. 因为高压缩率,所以解压的运行效率较低.
   这一点经过本人的测试.我是在android系统进行测试的.解压缩600KB多的数据,解压缩的时间在6秒左右,时间很慢.
   不知道是不是我不会写的多线程的代码,感觉和wiki百科的说的"适合嵌入式系统"的说法有冲突.

* LZMA的集成
因为要将程序集成到Android系统中,没有使用动态链接库进行集成,所以需要通过源码进行集成.
要集成到要使用lzma算法进行开发过程中,遇到了很大的问题,主要就是官方文档中没有明确的
